In [5]:
!git clone https://github.com/MudduChaithanyaSai/internship-test2.git

Cloning into 'internship-test2'...
remote: Enumerating objects: 88, done.
remote: Counting objects: 100% (88/88), done.
remote: Compressing objects: 100% (81/81), done.
remote: Total 88 (delta 39), reused 15 (delta 2), pack-reused 0
Unpacking objects: 100% (88/88), done.

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
import pandas as pd

In [6]:
#add respective path of the mian.csv file here
data_path = "/content/internship-test2/input/question-1/main.csv"

In [7]:
df = pd.read_csv(data_path)

In [8]:
df.shape

(55, 12)

In [9]:
df.head()

   Year  Population    Total  ...  Burglary  Larceny_Theft  Vehicle_Theft
0  1960   179323175  3384200  ...    912100        1855400         328200
1  1961   182992000  3488000  ...    949600        1913000         336000
2  1962   185771000  3752200  ...    994300        2089600         366800
3  1963   188483000  4109500  ...   1086400        2297800         408300
4  1964   191141000  4564600  ...   1213200        2514400         472800

[5 rows x 12 columns]

In [10]:
df.keys()

Index(['Year', 'Population', 'Total', 'Violent', 'Property', 'Murder',
       'Forcible_Rape', 'Robbery', 'Aggravated_assault', 'Burglary',
       'Larceny_Theft', 'Vehicle_Theft'],
      dtype='object')

In [11]:
df = df.drop(columns = "Total")

In [12]:
df = df.set_index("Year")

In [13]:
df.head()

      Population  Violent  Property  ...  Burglary  Larceny_Theft  Vehicle_Theft
Year                                 ...
1960   179323175   288460   3095700  ...    912100        1855400         328200
1961   182992000   289390   3198600  ...    949600        1913000         336000
1962   185771000   301510   3450700  ...    994300        2089600         366800
1963   188483000   316970   3792500  ...   1086400        2297800         408300
1964   191141000   364220   4200400  ...   1213200        2514400         472800

[5 rows x 10 columns]

In [15]:
df.index.name = None
df.head()

      Population  Violent  Property  ...  Burglary  Larceny_Theft  Vehicle_Theft
1960   179323175   288460   3095700  ...    912100        1855400         328200
1961   182992000   289390   3198600  ...    949600        1913000         336000
1962   185771000   301510   3450700  ...    994300        2089600         366800
1963   188483000   316970   3792500  ...   1086400        2297800         408300
1964   191141000   364220   4200400  ...   1213200        2514400         472800

[5 rows x 10 columns]

In [17]:
df.to_csv("/content/internship-test2/output/answer-1/main.csv")